#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.backend.random_pet.pet_name: Refreshing state... [id=wondrous-pig]
module.frontend.random_pet.pet_name: Refreshing state... [id=fond-antelope]
module.backend.module.asp.module.rgp.azurerm_resource_group.rgp: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/prod-rgp-cis-neubank-use-001]
module.vnet.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/prod-rgp-cis-neubank-use-001/providers/Microsoft.Network/virtualNetworks/prod-vnet-cis-neubank]
module.vnet.module.rgp.azurerm_resource_group.rgp: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/prod-rgp-cis-neubank-use-001]
module.frontend.module.asp.module.rgp.azurerm_resource_group.rgp: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/prod-rgp-cis-neubank-use-001]
module.frontend.module.asp.azurerm_service_plan.asp: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/prod-rgp-cis-neubank-use-001/providers/Microsoft.Web/serverFarms/prod-asp-cis-neubank-use-001]
module.backend.module.asp.azurerm_service_plan.asp: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/prod-rgp-cis-neubank-use-001/providers/Microsoft.Web/serverFarms/prod-asp-cis-neubank-use-001]
module.backend.azurerm_linux_web_app.backend_linux_web_app: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/prod-rgp-cis-neubank-use-001/providers/Microsoft.Web/sites/prod-backend-wondrous-pig-service-cis-neubank-use-001]
module.frontend.azurerm_linux_web_app.backend_linux_web_app: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/prod-rgp-cis-neubank-use-001/providers/Microsoft.Web/sites/prod-backend-fond-antelope-service-cis-neubank-use-001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.backend.azurerm_linux_web_app.backend_linux_web_app will be updated in-place
  ~ resource "azurerm_linux_web_app" "backend_linux_web_app" {
        id                                             = "/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/prod-rgp-cis-neubank-use-001/providers/Microsoft.Web/sites/prod-backend-wondrous-pig-service-cis-neubank-use-001"
        name                                           = "prod-backend-wondrous-pig-service-cis-neubank-use-001"
        tags                                           = {
            "Environment" = "Prod"
            "Owner"       = "first.last@company.com"
            "Project"     = "Mortgage Calculator"
        }
      + virtual_network_subnet_id                      = (known after apply)
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.frontend.azurerm_linux_web_app.backend_linux_web_app will be updated in-place
  ~ resource "azurerm_linux_web_app" "backend_linux_web_app" {
        id                                             = "/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/prod-rgp-cis-neubank-use-001/providers/Microsoft.Web/sites/prod-backend-fond-antelope-service-cis-neubank-use-001"
        name                                           = "prod-backend-fond-antelope-service-cis-neubank-use-001"
        tags                                           = {
            "Environment" = "Prod"
            "Owner"       = "first.last@company.com"
            "Project"     = "Mortgage Calculator"
        }
      + virtual_network_subnet_id                      = (known after apply)
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.vnet.azurerm_virtual_network.vnet will be destroyed
  # (because azurerm_virtual_network.vnet is not in configuration)
  - resource "azurerm_virtual_network" "vnet" {
      - address_space           = [
          - "10.0.0.0/16",
        ] -> null
      - dns_servers             = [] -> null
      - flow_timeout_in_minutes = 0 -> null
      - guid                    = "858084cb-f65f-4af8-83e6-b719ccf1edd8" -> null
      - id                      = "/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/prod-rgp-cis-neubank-use-001/providers/Microsoft.Network/virtualNetworks/prod-vnet-cis-neubank" -> null
      - location                = "eastus" -> null
      - name                    = "prod-vnet-cis-neubank" -> null
      - resource_group_name     = "prod-rgp-cis-neubank-use-001" -> null
      - subnet                  = [] -> null
      - tags                    = {
          - "Environment" = "Prod"
          - "Owner"       = "first.last@company.com"
          - "Project"     = "Mortgage Calculator"
        } -> null
    }

  # module.backend.module.subnet.azurerm_subnet.app_service_subnet will be created
  + resource "azurerm_subnet" "app_service_subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "app-service-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "prod-rgp-cis-neubank-use-001"
      + virtual_network_name                           = "prod-vnet-cis-neubank"
    }

  # module.frontend.module.subnet.azurerm_subnet.app_service_subnet will be created
  + resource "azurerm_subnet" "app_service_subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "app-service-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "prod-rgp-cis-neubank-use-001"
      + virtual_network_name                           = "prod-vnet-cis-neubank"
    }

  # module.vnet.module.rgp.azurerm_resource_group.rgp will be destroyed
  # (because azurerm_resource_group.rgp is not in configuration)
  - resource "azurerm_resource_group" "rgp" {
      - id       = "/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/prod-rgp-cis-neubank-use-001" -> null
      - location = "eastus" -> null
      - name     = "prod-rgp-cis-neubank-use-001" -> null
      - tags     = {
          - "Environment" = "Prod"
          - "Owner"       = "first.last@company.com"
          - "Project"     = "Mortgage Calculator"
        } -> null
    }

  # module.backend.module.subnet.module.rgp.azurerm_resource_group.rgp will be created
  + resource "azurerm_resource_group" "rgp" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "prod-rgp-cis-neubank-use-001"
      + tags     = {
          + "Environment" = "Prod"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
    }

  # module.backend.module.subnet.module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "prod-vnet-cis-neubank"
      + resource_group_name = "prod-rgp-cis-neubank-use-001"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment" = "Prod"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
    }

  # module.frontend.module.subnet.module.rgp.azurerm_resource_group.rgp will be created
  + resource "azurerm_resource_group" "rgp" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "prod-rgp-cis-neubank-use-001"
      + tags     = {
          + "Environment" = "Prod"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
    }

  # module.frontend.module.subnet.module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "prod-vnet-cis-neubank"
      + resource_group_name = "prod-rgp-cis-neubank-use-001"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment" = "Prod"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
    }

  # module.backend.module.subnet.module.vnet.module.rgp.azurerm_resource_group.rgp will be created
  + resource "azurerm_resource_group" "rgp" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "prod-rgp-cis-neubank-use-001"
      + tags     = {
          + "Environment" = "Prod"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
    }

  # module.frontend.module.subnet.module.vnet.module.rgp.azurerm_resource_group.rgp will be created
  + resource "azurerm_resource_group" "rgp" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "prod-rgp-cis-neubank-use-001"
      + tags     = {
          + "Environment" = "Prod"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
    }

Plan: 8 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dbwest, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Prod`*